<?php

return [
	'base_set' => [
		'root' => dirname(__FILE__),
		'host' => '0.0.0.0',
		'port' => '8888',
		'client_tip' => "欢迎您来到stone的聊天室",
		'server_tip' => "\n
		####################################################################################
		####################################################################################
		####                                                                            ####
		####             恭喜您 Swoole-WebSocket服务器脚本运行成功！                    ####
		####                                                                            ####
		####      提示：1、此脚本默认以非守护进程运行，按Ctrl + C 关闭脚本              ####
		####            2、如要修改脚本以守护进程在后台运行，参考下面操作               ####
		####      操作：(假设运行脚本为do.php)                                          ####
		####          1、打开 ..path/src/config.php目录，修改 daemonize => 1            ####
		####          2、重新运行 php do.php                                            ####
		####          3、查看脚本进程：                                                 ####
		####             ps -fea | grep 'do.php'                                        ####
		####          4、关闭脚本：                                                     ####
		####             ps -fea | grep 'do.php' | awk '{print $2}' | xargs kill -9     ####
		####                                                                            ####
		####                                           BY 石磊                          ####
		####                                                                            ####
		####################################################################################
		####################################################################################
		\n
		",
	],
	'server_set' => [
		'timeout' => 2.5,
		'max_conn' => 10000,
		'daemonize' => 0,
		'backlog' => 128,
		'max_request' => 50,
		'dispatch_mode'=> 5,
		'log_file' => dirname(__FILE__).'/log/swoole.log',
	],
];